ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_lin_regs.xml
	<register id="LINCOMP" width="32" page="0" offset="0x60" instances="1" instaddr="4" internal="0" description="Compare register">
		<bitfield id="SBREAK" description="Sync Break Extend" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="SDEL" description="Sync Delimiter Compare" begin="9" end="8" width="2" rwaccess="RW"/>
	</register>
	<register id="LINRD0" width="32" page="0" offset="0x64" instances="1" instaddr="4" internal="0" description="Receive data register 0">
		<bitfield id="RD3" description="Receive Buffer 3" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="RD2" description="Receive Buffer 2" begin="15" end="8" width="8" rwaccess="R"/>
		<bitfield id="RD1" description="Receive Buffer 1" begin="23" end="16" width="8" rwaccess="R"/>
		<bitfield id="RD0" description="Receive Buffer 0" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="LINRD1" width="32" page="0" offset="0x68" instances="1" instaddr="4" internal="0" description="Receive data register 1">
		<bitfield id="RD7" description="Receive Buffer 3" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="RD6" description="Receive Buffer 2" begin="15" end="8" width="8" rwaccess="R"/>
		<bitfield id="RD5" description="Receive Buffer 1" begin="23" end="16" width="8" rwaccess="R"/>
		<bitfield id="RD4" description="Receive Buffer 0" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="LINMASK" width="32" page="0" offset="0x6c" instances="1" instaddr="4" internal="0" description="Acceptance mask register">
		<bitfield id="TXIDMASK" description="TX ID Mask bits (LIN only)" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="RXIDMASK" description="RX ID Mask bits (LIN only)" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="LINID" width="32" page="0" offset="0x70" instances="1" instaddr="4" internal="0" description="LIN ID Register">
		<bitfield id="IDBYTE" description="LIN message ID (LIN only)" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="IDRESPONDERTASKBYTE" description="ID  Responder Task byte (LIN only)" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="RECEIVEDID" description="Current Message ID (LIN only)" begin="23" end="16" width="8" rwaccess="R"/>
	</register>
	<register id="LINTD0" width="32" page="0" offset="0x74" instances="1" instaddr="4" internal="0" description="Transmit Data Register 0">
		<bitfield id="TD3" description="TRANSMIT Buffer 3" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="TD2" description="TRANSMIT Buffer 2" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="TD1" description="TRANSMIT Buffer 1" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="TD0" description="TRANSMIT Buffer 0" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="LINTD1" width="32" page="0" offset="0x78" instances="1" instaddr="4" internal="0" description="Transmit Data Register 1">
		<bitfield id="TD7" description="TRANSMIT Buffer 7" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="TD6" description="TRANSMIT Buffer 6" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="TD5" description="TRANSMIT Buffer 5" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="TD4" description="TRANSMIT Buffer 4" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="MBRSR" width="32" page="0" offset="0x7c" instances="1" instaddr="4" internal="0" description="Maximum Baud Rate Selection Register">
		<bitfield id="MBR" description="Received Data." begin="12" end="0" width="13" rwaccess="RW"/>
	</register>
	<register id="IODFTCTRL" width="32" page="0" offset="0x90" instances="1" instaddr="4" internal="0" description="IODFT for LIN">
		<bitfield id="RXPENA" description="Analog Loopback Via Receive Pin Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LPBENA" description="Module Loopback Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="IODFTENA" description="IO DFT Enable Key" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="TXSHIFT" description="Transmit Delay Shift" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="PINSAMPLEMASK" description="TX Pin Sample Mask" begin="20" end="19" width="2" rwaccess="RW"/>
		<bitfield id="BRKDTERRENA" description="Break Detect Error Enable (SCI compatibility mode)" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="PERRENA" description="Parity Error Enable (SCI compatibility mode)" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="FERRENA" description="Frame Error Enable (SCI compatibility mode)" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="ISFERRENA" description="Inconsistent Sync Field Error Enable (LIN mode)" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="CERRENA" description="Checksum Error Enable(LIN mode)" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="PBERRENA" description="Physical Bus Error Enable (LIN mode)" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="BERRENA" description="Bit Error Enable (LIN mode)" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="LIN_GLB_INT_EN" width="32" page="0" offset="0xe0" instances="1" instaddr="4" internal="0" description="LIN Global Interrupt Enable Register">
		<bitfield id="GLBINT0_EN" description="Global Interrupt Enable for LIN INT0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GLBINT1_EN" description="Global Interrupt Enable for LIN INT1" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="LIN_GLB_INT_FLG" width="32" page="0" offset="0xe4" instances="1" instaddr="4" internal="0" description="LIN Global Interrupt Flag Register">
		<bitfield id="INT0_FLG" description="Global Interrupt Flag for LIN INT0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INT1_FLG" description="Global Interrupt Flag for LIN INT1" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="LIN_GLB_INT_CLR" width="32" page="0" offset="0xe8" instances="1" instaddr="4" internal="0" description="LIN Global Interrupt Clear Register">
		<bitfield id="INT0_FLG_CLR" description="Global Interrupt flag clear for LIN INT0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INT1_FLG_CLR" description="Global Interrupt flag  clear for LIN INT1" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
</module>
